<?php

/** @var yii\web\View $this */

use yii\helpers\Html;

$this->title = 'Обо мне ';

?>
<div class="site-about">
 

 
    <div class="container">
    <div class="row">
      <div class="col-md-8 offset-md-2">
        <h1 class="text-center">Мое резюме</h1>
        <hr>
        <p>Меня зовут Никита, и я занимаюсь программированием ещё со школы. С тех пор я успел написать несколько ботов и изучить HTML. Также я имею опыт работы с языком C++. Когда начал учиться в университете, я успешно выполнял лабораторные работы и регулярно помогал своим одногруппникам за дополнительную плату.</p>
        <p>Во время производственной практики в компании Cinimex я работал с языком Java и фреймворком Spring Boot. Я изучал работу с API, взаимодействие объектов, работу с базами данных и многое другое. Этим летом я летал со своим отрядом в Турцию и работал на атомной станции "Akkuyu". После лета стал преподавателем по веб-разработке, где начал обучать детей созданию сайтов с использованием HTML и CSS. Благодаря этому я получил опыт во фронтенд-разработке.</p>
        <p>Сейчас я прохожу практику в компании ЭФКО "Цифровые Решения", где в настоящее время продолжаю обучение. Здесь я изучаю фреймворк PHP и фреймоврк Yii2, работу с базами данных с использованием инструментов фреймворка и создание собственных API. Я также выполнял задания по доработке сайта путем интеграции бэкенда с фронтендом.</p>
      </div>
    </div>
  </div>

  <script src="https://code.jquery.com/jquery-3.5.1.slim.min.js"></script>
  <script src="https://cdn.jsdelivr.net/npm/@popperjs/core@2.5.4/dist/umd/popper.min.js"></script>
  <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/js/bootstrap.min.js"></script>
</body>
</html>

    <code><?= __FILE__ ?></code>
</div>
